piborisovich/microcontrollers/Milandr/Libraries/SPL/MDR32VF0xI/src/MDR32VF0xI_rst_clk.c
/**
 *******************************************************************************
 * @file    MDR32VF0xI_rst_clk.c
 * @author  Milandr Application Team
 * @version V0.2.0
 * @date    23/05/2025
 * @brief   This file contains all the RST_CLK firmware functions.
 *******************************************************************************
 * <br><br>
 *
 * THE PRESENT FIRMWARE IS FOR GUIDANCE ONLY. IT AIMS AT PROVIDING CUSTOMERS
 * WITH CODING INFORMATION REGARDING MILANDR'S PRODUCTS IN ORDER TO FACILITATE
 * THE USE AND SAVE TIME. MILANDR SHALL NOT BE HELD LIABLE FOR ANY
 * DIRECT, INDIRECT OR CONSEQUENTIAL DAMAGES RESULTING
 * FROM THE CONTENT OF SUCH FIRMWARE AND/OR A USE MADE BY CUSTOMERS OF THE
 * CODING INFORMATION CONTAINED HEREIN IN THEIR PRODUCTS.
 *
 * <h2><center>&copy; COPYRIGHT 2025 Milandr</center></h2>
 *******************************************************************************
 */

/* Includes ------------------------------------------------------------------*/
#include "MDR32VF0xI_rst_clk.h"
#if defined(USE_MDR32F02) || defined(USE_MDR1206FI) || defined(USE_MDR1206AFI) || defined(USE_MDR1206)
#include "MDR32VF0xI_utils.h"
#endif

/** @addtogroup MDR32VF0xI_StdPeriph_Driver MDR32VF0xI Standard Peripheral Driver
 * @{
 */

/** @defgroup RST_CLK RST_CLK
 * @{
 */

/** @defgroup RST_CLK_Exported_Functions RST_CLK Exported Functions
 * @{
 */

/**
 * @brief  Set the RST_CLK clock configuration to the default reset state.
 * @param  None.
 * @return None.
 */
void RST_CLK_DeInit(void)
{
    uint32_t BKP_OldKey;

    /* Reset all peripheral clocks except RST_CLK and BKP_CLK. */
    MDR_RST_CLK->PER2_CLOCK = (RST_CLK_PER2_CLOCK_PCLK_EN_RST_CLK | RST_CLK_PER2_CLOCK_PCLK_EN_BKP);

    /* Read BKP key to variable. */
    BKP_OldKey = MDR_BKP->WPR;
    /* Write key to BKP_WPR to unlock access if key is not written. */
    if (BKP_OldKey != BKP_WPR_BKP_WPR_UNLOCK) {
        MDR_BKP->WPR = BKP_WPR_BKP_WPR_UNLOCK;
    }

    /* Enable HSI in BKP because RST_CLK deinitialization changes HCLK source to HSI. */
    MDR_BKP->CLK |= BKP_CLK_HSI_ON;

    /* Wait until HSI is ready. */
    while ((MDR_BKP->CLK & BKP_CLK_HSI_RDY) == RESET) { }

    /* Lock BKP access if it was locked before function call. */
    if (BKP_OldKey != BKP_WPR_BKP_WPR_UNLOCK) {
        MDR_BKP->WPR = BKP_OldKey;
    }

    /* Reset all peripheral clocks except RST_CLK. */
    MDR_RST_CLK->PER2_CLOCK = RST_CLK_PER2_CLOCK_PCLK_EN_RST_CLK;

    MDR_RST_CLK->ADC_CLOCK = (uint32_t)0x00000000;
    MDR_RST_CLK->RTC_CLOCK = (uint32_t)0x00000000;

    /* Reset everything except DMA_EN bit. */
    MDR_RST_CLK->PER1_CLOCK = RST_CLK_PER1_CLOCK_DMA_EN;

    MDR_RST_CLK->TIM_CLOCK  = (uint32_t)0x00000000;
    MDR_RST_CLK->UART_CLOCK = (uint32_t)0x00000000;
    MDR_RST_CLK->SSP_CLOCK  = (uint32_t)0x00000000;

#if defined(USE_MDR32F02_REV_2) || defined(USE_MDR1206FI) || defined(USE_MDR1206AFI) || defined(USE_MDR1206)
    MDR_RST_CLK->DMA_DONE_STICK = (uint32_t)0x00000000;
    MDR_RST_CLK->DIV_SYS_TIM    = (uint32_t)0x00000000;
#endif

    /* Reset CPU_CLOCK bits. */
#if defined(USE_MDR32F02)
    /* HSI is selected as HCLK. */
    MDR_RST_CLK->CPU_CLOCK = (uint32_t)0x00000000;
#elif defined(USE_MDR1206FI) || defined(USE_MDR1206AFI) || defined(USE_MDR1206)
    /* CPU_C3 (from HSI) divided by 16 is selected as HCLK. */
    MDR_RST_CLK->CPU_CLOCK = ((uint32_t)RST_CLK_CPU_C3_PRESCALER_DIV_16 | RST_CLK_CPU_CLOCK_HCLK_SEL_CPU_C3);
#endif
    MDR_RST_CLK->PLL_CONTROL = (uint32_t)0x00000000;
    MDR_RST_CLK->HS_CONTROL  = (uint32_t)0x00000000;
}

/**
 * @brief    Initialize the HCLK clock path according to
 *           the specified parameters in the RST_CLK_HCLK_InitStruct.
 * @note:    Necessary clock sources should be enabled before calling this function (as they are not configured by this function).
 * @note:    This function also updates SystemCoreClock variable.
 * @note:    The parameters that are not used in the selected path are not configurable.
 *           The only exception is PLL state which will turn off if not used for CPU_C2 (and CPU_C2 is used for HCLK).
 * @warning: If function failed to configure HCLK (due to PLL not ready), HCLK will fallback to HSI if HCLK was configured from CPU_C3 before.
 *           The only exception is PLL state which will turn off if not used for CPU_C2 (and CPU_C2 is used for HCLK).
 * @param    RST_CLK_HCLK_InitStruct: The pointer to the @ref RST_CLK_HCLK_InitTypeDef structure
 *           that contains the configuration information for the HCLK clock path.
 * @return   @ref ErrorStatus - SUCCESS if HCLK clock configured, else ERROR.
 */
ErrorStatus RST_CLK_HCLK_Init(const RST_CLK_HCLK_InitTypeDef* RST_CLK_HCLK_InitStruct)
{
    uint32_t Temp1, Temp2;

    /* Check the parameters. */
    assert_param(IS_RST_CLK_HCLK_CLOCK_SOURCE(RST_CLK_HCLK_InitStruct->RST_CLK_HCLK_ClockSource));
    assert_param((RST_CLK_HCLK_InitStruct->RST_CLK_HCLK_ClockSource == RST_CLK_CPU_HCLK_CLK_SRC_CPU_C3) ? IS_RST_CLK_CPU_C3_DIV(RST_CLK_HCLK_InitStruct->RST_CLK_CPU_C3_Prescaler) : 1);
    assert_param((RST_CLK_HCLK_InitStruct->RST_CLK_HCLK_ClockSource == RST_CLK_CPU_HCLK_CLK_SRC_CPU_C3) ? IS_RST_CLK_CPU_C2_CLOCK_SOURCE(RST_CLK_HCLK_InitStruct->RST_CLK_CPU_C2_ClockSource) : 1);
    assert_param(((RST_CLK_HCLK_InitStruct->RST_CLK_HCLK_ClockSource == RST_CLK_CPU_HCLK_CLK_SRC_CPU_C3) && (RST_CLK_HCLK_InitStruct->RST_CLK_CPU_C2_ClockSource == RST_CLK_CPU_C2_CLK_SRC_PLLCPU)) ? IS_RST_CLK_PLLCPU_MUL(RST_CLK_HCLK_InitStruct->RST_CLK_PLLCPU_Multiplier) : 1);
    assert_param(((RST_CLK_HCLK_InitStruct->RST_CLK_HCLK_ClockSource == RST_CLK_CPU_HCLK_CLK_SRC_CPU_C3) && (RST_CLK_HCLK_InitStruct->RST_CLK_CPU_C2_ClockSource == RST_CLK_CPU_C2_CLK_SRC_PLLCPU)) ? IS_RST_CLK_PLLCPU_CLOCK_SOURCE(RST_CLK_HCLK_InitStruct->RST_CLK_PLLCPU_ClockSource) : 1);
    assert_param(((RST_CLK_HCLK_InitStruct->RST_CLK_HCLK_ClockSource == RST_CLK_CPU_HCLK_CLK_SRC_CPU_C3) && (((RST_CLK_HCLK_InitStruct->RST_CLK_CPU_C2_ClockSource == RST_CLK_CPU_C2_CLK_SRC_PLLCPU) && (RST_CLK_HCLK_InitStruct->RST_CLK_PLLCPU_ClockSource == RST_CLK_PLLCPU_CLK_SRC_CPU_C1)) || (RST_CLK_HCLK_InitStruct->RST_CLK_CPU_C2_ClockSource == RST_CLK_CPU_C2_CLK_SRC_CPU_C1))) ? IS_RST_CLK_CPU_C1_CLOCK_SOURCE(RST_CLK_HCLK_InitStruct->RST_CLK_CPU_C1_Source) : 1);

    if (RST_CLK_HCLK_InitStruct->RST_CLK_HCLK_ClockSource == RST_CLK_CPU_HCLK_CLK_SRC_CPU_C3) {
        Temp1 = MDR_RST_CLK->CPU_CLOCK;
        if ((Temp1 & RST_CLK_CPU_CLOCK_HCLK_SEL_Msk) == RST_CLK_CPU_CLOCK_HCLK_SEL_CPU_C3) {
            /* Switch HCLK from CPU_C3 to HSI to safely configure new HCLK clock path. */
            RST_CLK_HCLK_ClkSelection(RST_CLK_CPU_HCLK_CLK_SRC_HSI);
        }

        /* PLL is selected as new HCLK source. */
        if (RST_CLK_HCLK_InitStruct->RST_CLK_CPU_C2_ClockSource == RST_CLK_CPU_C2_CLK_SRC_PLLCPU) {
            if ((MDR_RST_CLK->CPU_CLOCK & RST_CLK_CPU_CLOCK_CPU_C2_SEL_Msk) == RST_CLK_CPU_CLOCK_CPU_C2_SEL) {
                /* If PLL is source of CPU_C2, switch to CPU_C1 as CPU_C2 to safely (re)configure PLL. */
                RST_CLK_CPU_C2_ClkSelection(RST_CLK_CPU_C2_CLK_SRC_CPU_C1);
            }
            Temp2 = MDR_RST_CLK->PLL_CONTROL;
            if (RST_CLK_CPU_PLL_GetCmdState() == ENABLE) {
                /* Disable PLL before reconfiguration. */
                RST_CLK_CPU_PLL_Cmd(DISABLE);
            }
            if (RST_CLK_HCLK_InitStruct->RST_CLK_PLLCPU_ClockSource == RST_CLK_PLLCPU_CLK_SRC_CPU_C1) {
                /* If PLL source will be CPU_C1, configure CPU_C1 source. */
                RST_CLK_CPU_C1_ClkSelection(RST_CLK_HCLK_InitStruct->RST_CLK_CPU_C1_Source);
            }

            /* Configure PLL. */
            RST_CLK_CPU_PLL_Config(RST_CLK_HCLK_InitStruct->RST_CLK_PLLCPU_ClockSource, RST_CLK_HCLK_InitStruct->RST_CLK_PLLCPU_Multiplier);
            RST_CLK_CPU_PLL_Cmd(ENABLE);
            SystemCoreClockUpdate();
            if (RST_CLK_CPU_PLL_GetStatus() == ERROR) {
                /* Restore previous PLL state. */
                MDR_RST_CLK->PLL_CONTROL = Temp2;
                SystemCoreClockUpdate();
                if ((Temp1 & (RST_CLK_CPU_CLOCK_CPU_C2_SEL_Msk | RST_CLK_CPU_CLOCK_HCLK_SEL_Msk)) == (RST_CLK_CPU_CLOCK_CPU_C2_SEL | RST_CLK_CPU_CLOCK_HCLK_SEL_CPU_C3) &&
                    RST_CLK_CPU_PLL_GetStatus() == ERROR) {
                    /* If PLL was used before and it is not ready again in its previous state, fallback to HSI. */
                    MDR_RST_CLK->CPU_CLOCK = Temp1 & ~RST_CLK_CPU_CLOCK_HCLK_SEL_Msk;
                } else {
                    /* Restore previous HCLK state. */
                    MDR_RST_CLK->CPU_CLOCK = Temp1;
                }
                return ERROR;
            }
        }

        RST_CLK_CPU_C2_ClkSelection(RST_CLK_HCLK_InitStruct->RST_CLK_CPU_C2_ClockSource);
        RST_CLK_CPU_C3_SetPrescaler(RST_CLK_HCLK_InitStruct->RST_CLK_CPU_C3_Prescaler);
        RST_CLK_HCLK_ClkSelection(RST_CLK_HCLK_InitStruct->RST_CLK_HCLK_ClockSource);
    } else {
        RST_CLK_HCLK_ClkSelection(RST_CLK_HCLK_InitStruct->RST_CLK_HCLK_ClockSource);
    }
    SystemCoreClockUpdate();
    return SUCCESS;
}

/**
 * @brief  Fill each RST_CLK_HCLK_InitTypeDef member with its default (i.e. reset) value.
 * @param  RST_CLK_HCLK_InitStruct: The pointer to the @ref RST_CLK_HCLK_InitTypeDef structure
 *         which is to be initialized.
 * @return None.
 */
void RST_CLK_HCLK_StructInit(RST_CLK_HCLK_InitTypeDef* RST_CLK_HCLK_InitStruct)
{
    RST_CLK_HCLK_InitStruct->RST_CLK_CPU_C1_Source      = RST_CLK_CPU_C1_CLK_SRC_HSI;
    RST_CLK_HCLK_InitStruct->RST_CLK_PLLCPU_ClockSource = RST_CLK_PLLCPU_CLK_SRC_CPU_C1;
    RST_CLK_HCLK_InitStruct->RST_CLK_PLLCPU_Multiplier  = RST_CLK_PLLCPU_MUL_1;
    RST_CLK_HCLK_InitStruct->RST_CLK_CPU_C2_ClockSource = RST_CLK_CPU_C2_CLK_SRC_CPU_C1;
#if defined(USE_MDR32F02)
    RST_CLK_HCLK_InitStruct->RST_CLK_CPU_C3_Prescaler = RST_CLK_CPU_C3_PRESCALER_DIV_1;
    RST_CLK_HCLK_InitStruct->RST_CLK_HCLK_ClockSource = RST_CLK_CPU_HCLK_CLK_SRC_HSI;
#else
    RST_CLK_HCLK_InitStruct->RST_CLK_CPU_C3_Prescaler = RST_CLK_CPU_C3_PRESCALER_DIV_16;
    RST_CLK_HCLK_InitStruct->RST_CLK_HCLK_ClockSource = RST_CLK_CPU_HCLK_CLK_SRC_CPU_C3;
#endif
}

/**
 * @brief  HSE (High Speed External) clock mode and source selection based on @ref HSE_EXT_GEN_MODE definition.
 * @param  NewState: @ref FunctionalState - a new state of the HSE clock.
 * @return None.
 */
void RST_CLK_HSE_Cmd(FunctionalState NewState)
{
    /* Check the parameters. */
    assert_param(IS_FUNCTIONAL_STATE(NewState));

