piborisovich/microcontrollers/Milandr/Libraries/SPL/MDR32VF0xI/src/MDR32VF0xI_rst_clk.c
    if (NewState != DISABLE) {
#if !defined(HSE_EXT_GEN_MODE)
        MDR_RST_CLK->HS_CONTROL = (MDR_RST_CLK->HS_CONTROL & ~RST_CLK_HS_CONTROL_HSE_BYP) | RST_CLK_HS_CONTROL_HSE_ON;
#else
        MDR_RST_CLK->HS_CONTROL |= (RST_CLK_HS_CONTROL_HSE_BYP | RST_CLK_HS_CONTROL_HSE_ON);
#endif
    } else {
#if !defined(HSE_EXT_GEN_MODE)
        MDR_RST_CLK->HS_CONTROL &= ~(RST_CLK_HS_CONTROL_HSE_BYP | RST_CLK_HS_CONTROL_HSE_ON);
#else
        MDR_RST_CLK->HS_CONTROL = (MDR_RST_CLK->HS_CONTROL | RST_CLK_HS_CONTROL_HSE_BYP) & ~RST_CLK_HS_CONTROL_HSE_ON;
#endif
    }
}

/**
 * @brief  HSE (High Speed External) clock mode and source selection.
 * @param  HSE_Mode: @ref RST_CLK_HSE_Mode_TypeDef - mode selector.
 * @return None.
 */
void RST_CLK_HSE_Config(RST_CLK_HSE_Mode_TypeDef HSE_Mode)
{
    /* Check the parameters. */
    assert_param(IS_RST_CLK_HSE(HSE_Mode));

    /* Reset HSEON and HSEBYP bits before configuring the HSE */
    MDR_RST_CLK->HS_CONTROL &= ~(RST_CLK_HS_CONTROL_HSE_ON | RST_CLK_HS_CONTROL_HSE_BYP);

    MDR_RST_CLK->HS_CONTROL |= (uint32_t)HSE_Mode;
}

/**
 * @brief  Get the HSE clock mode and source selection.
 * @param  None.
 * @return @ref RST_CLK_HSE_Mode_TypeDef - current HSE mode mode and source selection.
 */
RST_CLK_HSE_Mode_TypeDef RST_CLK_HSE_GetModeConfig(void)
{
    return (RST_CLK_HSE_Mode_TypeDef)(MDR_RST_CLK->HS_CONTROL &
                                      (RST_CLK_HS_CONTROL_HSE_ON | RST_CLK_HS_CONTROL_HSE_BYP));
}

/**
 * @brief  Get HSE clock status.
 * @note   The cycle counter and core clock from SystemCoreClock are used for delay. Do not disable the cycle counter.
 *         Before calling this function, you must update SystemCoreClock by calling SystemCoreClockUpdate().
 *         If the HSERDY_USER_TIMEOUT_MS definition is active, the start time for MDR1206 is calculated based on the resonator characteristics.
 * @param  None.
 * @return @ref ErrorStatus - SUCCESS if HSE clock is ready, else ERROR.
 */
ErrorStatus RST_CLK_HSE_GetStatus(void)
{
    uint32_t    DelayConst;
    ErrorStatus State;
    FlagStatus  Flag;

    DelayConst = DELAY_CYCLE_COUNTER_GET_CONST_US(SystemCoreClock);

    /* Wait until HSE time out has occurred. */
#if defined(HSERDY_USER_TIMEOUT_MS)

/** Pi - Pi (to the tenth digit) for calculating startup time HSE. */
#define Pi (3.1415926535f)
/** Omega - cyclic frequency. */
#define Omega (2 * Pi * QUARTZ_FREQUENCY_HSE_Hz)
/** K - proportionality coefficient. Gm - transconductance of the amplifying transistor (A/V).
 * Internal microcontroller characteristics for the HSE generator.
 * Specified in the documentation and differs for CHIP_ID = 215 and CHIP_ID = 217. */
#define K_MDR1206AFI  25
#define K_MDR1206FI   12
#define Gm_MDR1206AFI (8.52e-3f)
#define Gm_MDR1206FI  (8.24e-3f)
/** Auxiliary components in calculating the start time. */
#define Comp                         (C_LOAD_HSE * C_LOAD_HSE + C_SHUNT_HSE * C_LOAD_HSE)
#define Slave_Numerator_MDR1206AFI   (4 * Gm_MDR1206AFI * C_LOAD_HSE * C_LOAD_HSE)
#define Slave_Numerator_MDR1206FI    (4 * Gm_MDR1206FI * C_LOAD_HSE * C_LOAD_HSE)
#define Slave_Denominator_MDR1206AFI ((Gm_MDR1206AFI * C_SHUNT_HSE * Gm_MDR1206AFI * C_SHUNT_HSE) + (16 * Omega * Omega * Comp * Comp))
#define Slave_Denominator_MDR1206FI  ((Gm_MDR1206FI * C_SHUNT_HSE * Gm_MDR1206FI * C_SHUNT_HSE) + (16 * Omega * Omega * Comp * Comp))

    volatile float Fraction, Main_Denominator, T_Start;

    /* Main startup time calculation */
    if (GetChipID() == CHIP_ID_MDR1206AFI) {
        Fraction         = Slave_Numerator_MDR1206AFI / Slave_Denominator_MDR1206AFI;
        Main_Denominator = Omega * (Fraction - RM_HSE);
        T_Start          = K_MDR1206AFI * ((QUALITY_FACTOR_HSE * RM_HSE) / Main_Denominator);
    } else {
        Fraction         = Slave_Numerator_MDR1206FI / Slave_Denominator_MDR1206FI;
        Main_Denominator = Omega * (Fraction - RM_HSE);
        T_Start          = K_MDR1206FI * ((QUALITY_FACTOR_HSE * RM_HSE) / Main_Denominator);
    }
    /* Convert seconds to milliseconds */
    T_Start *= 1000;

    DELAY_CycleCounter_WaitTicksAsm(DELAY_GET_TICKS_MS(((uint32_t)T_Start), DelayConst));
#else
    DELAY_CycleCounter_WaitTicksAsm(DELAY_GET_TICKS_MS(HSERDY_TIMEOUT_MS, DelayConst));
#endif

    Flag = RST_CLK_GetFlagStatus(RST_CLK_FLAG_HSERDY);

    if (Flag != RESET) {
        State = SUCCESS;
    } else {
        State = ERROR;
    }

    return State;
}

/**
 * @brief  Configure the CPU_PLL clock source and multiplication factor.
 * @param  PLLCPU_Source: @ref RST_CLK_PLLCPU_ClockSource_TypeDef - specify the PLL entry clock source.
 * @param  PLLCPU_Multiplier: @ref RST_CLK_PLLCPU_Multiplier_TypeDef - specify the PLL multiplication factor.
 * @return None.
 */
void RST_CLK_CPU_PLL_Config(RST_CLK_PLLCPU_ClockSource_TypeDef PLLCPU_Source, uint32_t PLLCPU_Multiplier)
{
    uint32_t Temp;

    /* Check the parameters. */
    assert_param(IS_RST_CLK_PLLCPU_CLOCK_SOURCE(PLLCPU_Source));
    assert_param(IS_RST_CLK_PLLCPU_MUL(PLLCPU_Multiplier));

    /* Select CPUPLL source. */
    Temp = MDR_RST_CLK->PLL_CONTROL;
    Temp &= ~RST_CLK_PLL_CONTROL_PLL_CPU_SEL_Msk;
    Temp |= (uint32_t)PLLCPU_Source;

    /* Set CPUPLL multiplier. */
    /* Clear PLLMUL[2:0] bits. */
    Temp &= ~RST_CLK_PLL_CONTROL_PLL_CPU_MUL_Msk;
    /* Set PLLMUL[2:0] bits. */
    Temp |= (PLLCPU_Multiplier << RST_CLK_PLL_CONTROL_PLL_CPU_MUL_Pos);
    /* Store the new value. */
    MDR_RST_CLK->PLL_CONTROL = Temp;
}

/**
 * @brief  Enable or disable the CPU_PLL clock.
 * @param  NewState: @ref FunctionalState - a new state of the CPU_PLL clock.
 * @return None.
 */
void RST_CLK_CPU_PLL_Cmd(FunctionalState NewState)
{
    uint32_t Temp;

    /* Check the parameters. */
    assert_param(IS_FUNCTIONAL_STATE(NewState));

    Temp = MDR_RST_CLK->PLL_CONTROL;

    if (NewState != DISABLE) {
        Temp |= RST_CLK_PLL_CONTROL_PLL_CPU_ON;
    } else {
        Temp &= ~RST_CLK_PLL_CONTROL_PLL_CPU_ON;
    }

    MDR_RST_CLK->PLL_CONTROL = Temp;
}

/**
 * @brief  Get the CPU_PLL clock work state.
 * @param  None.
 * @return @ref FunctionalState - the current work state of the CPU_PLL clock.
 */
FunctionalState RST_CLK_CPU_PLL_GetCmdState(void)
{
    FunctionalState State;

    if ((MDR_RST_CLK->PLL_CONTROL & RST_CLK_PLL_CONTROL_PLL_CPU_ON) == 0) {
        State = DISABLE;
    } else {
        State = ENABLE;
    }

