piborisovich/microcontrollers/Milandr/Libraries/SPL/MDR32VF0xI/src/MDR32VF0xI_rst_clk.c
    return State;
}

/**
 * @brief  Get CPU_PLL clock status.
 * @note   The cycle counter and core clock from SystemCoreClock are used for delay. Do not disable the cycle counter.
 *         Before calling this function, you must update SystemCoreClock by calling SystemCoreClockUpdate().
 * @param  None.
 * @return @ref ErrorStatus - SUCCESS if CPU_PLL output clock is ready, else ERROR.
 */
ErrorStatus RST_CLK_CPU_PLL_GetStatus(void)
{
    uint32_t    DelayConst;
    ErrorStatus State;
    FlagStatus  Flag;

    DelayConst = DELAY_CYCLE_COUNTER_GET_CONST_US(SystemCoreClock);

    /* Wait until CPUPLL time out has occurred. */
    DELAY_CycleCounter_WaitTicksAsm(DELAY_GET_TICKS_US(PLLCPURDY_TIMEOUT_US, DelayConst));

    Flag = RST_CLK_GetFlagStatus(RST_CLK_FLAG_PLLCPURDY);

    if (Flag != RESET) {
        State = SUCCESS;
    } else {
        State = ERROR;
    }

    return State;
}

/**
 * @brief  Select the CPU_C1 clock source.
 * @param  CPU_C1_Source: @ref RST_CLK_CPU_C1_ClockSource_TypeDef - specify the CPU_C1 clock source.
 * @return None.
 */
void RST_CLK_CPU_C1_ClkSelection(RST_CLK_CPU_C1_ClockSource_TypeDef CPU_C1_Source)
{
    uint32_t Temp = 0;

    /* Check the parameters. */
    assert_param(IS_RST_CLK_CPU_C1_CLOCK_SOURCE(CPU_C1_Source));

    Temp = MDR_RST_CLK->CPU_CLOCK;

    /* Clear CPU_C1_SEL bits. */
    Temp &= ~RST_CLK_CPU_CLOCK_CPU_C1_SEL_Msk;

    /* Set the CPU_C1_SEL bits. */
    Temp |= (uint32_t)CPU_C1_Source;

    /* Store the new value. */
    MDR_RST_CLK->CPU_CLOCK = Temp;
}

/**
 * @brief  Select the CPU_C2 clock source.
 * @param  CPU_C2_Source: @ref RST_CLK_CPU_C2_ClockSource_TypeDef - specify the CPU_C2 clock source.
 * @return None.
 */
void RST_CLK_CPU_C2_ClkSelection(RST_CLK_CPU_C2_ClockSource_TypeDef CPU_C2_Source)
{
    uint32_t Temp = 0;

    /* Check the parameters. */
    assert_param(IS_RST_CLK_CPU_C2_CLOCK_SOURCE(CPU_C2_Source));

    Temp = MDR_RST_CLK->CPU_CLOCK;
    Temp &= ~RST_CLK_CPU_CLOCK_CPU_C2_SEL;
    Temp |= (uint32_t)CPU_C2_Source;

    /* Configure CPU_CLOCK register with new value. */
    MDR_RST_CLK->CPU_CLOCK = Temp;
}

/**
 * @brief  Configure the CPU_C3_SEL division factor.
 * @param  CPU_CLK_DivValue: @ref RST_CLK_CPU_C3_Prescaler_TypeDef - specify the CPU_C3_SEL division factor.
 * @return None.
 */
void RST_CLK_CPU_C3_SetPrescaler(RST_CLK_CPU_C3_Prescaler_TypeDef CPU_CLK_DivValue)
{
    uint32_t Temp;

    /* Check the parameters. */
    assert_param(IS_RST_CLK_CPU_C3_DIV(CPU_CLK_DivValue));

    Temp = MDR_RST_CLK->CPU_CLOCK;

    /* Clear CPU_C3_SEL bits. */
    Temp &= ~RST_CLK_CPU_CLOCK_CPU_C3_SEL_Msk;

    /* Set CPU_C3_SEL bits. */
    Temp |= (uint32_t)CPU_CLK_DivValue;

    /* Store the new value. */
    MDR_RST_CLK->CPU_CLOCK = Temp;
}

/**
 * @brief  Select the HCLK clock source.
 * @param  CPU_HCLK_Source: @ref RST_CLK_HCLK_ClockSource_TypeDef - specify the HCLK clock source.
 * @return None.
 */
void RST_CLK_HCLK_ClkSelection(RST_CLK_HCLK_ClockSource_TypeDef CPU_HCLK_Source)
{
    uint32_t Temp;

    /* Check the parameters. */
    assert_param(IS_RST_CLK_HCLK_CLOCK_SOURCE(CPU_HCLK_Source));

    Temp = MDR_RST_CLK->CPU_CLOCK;

    /* Clear CPU_C3_SEL bits. */
    Temp &= ~RST_CLK_CPU_CLOCK_HCLK_SEL_Msk;

    /* Set the CPU_C3_SEL bits. */
    Temp |= (uint32_t)CPU_HCLK_Source;

    /* Store the new value. */
    MDR_RST_CLK->CPU_CLOCK = Temp;
}

/**
 * @brief  Select the ADC_C1 clock source.
 * @param  ADC_CLK_Source: @ref RST_CLK_ADC_ClockSource_TypeDef - specify the ADC_C1 clock source.
 * @return None.
 */
void RST_CLK_ADC_ClkSelection(RST_CLK_ADC_ClockSource_TypeDef ADC_CLK_Source)
{
    uint32_t Temp;

    /* Check the parameters. */
    assert_param(IS_RST_CLK_ADC_CLOCK_SOURCE(ADC_CLK_Source));

    /* Select ADC_CLK source. */
    Temp = MDR_RST_CLK->ADC_CLOCK;

    /* Clear ADC_C1 SEL bits. */
    Temp &= ~(RST_CLK_ADC_CLOCK_ADC_C1_SEL_Msk);

    /* Set ADC_C1 SEL bits. */
    Temp |= (uint32_t)ADC_CLK_Source;

    /* Store the new value. */
    MDR_RST_CLK->ADC_CLOCK = Temp;
}

/**
 * @brief  Configure the ADC_C3_SEL division factor.
 * @param  ADC_CLK_DivValue: @ref RST_CLK_ADC_C3_Prescaler_TypeDef - specify the ADC_C3_SEL division factor.
 * @return None.
 */
void RST_CLK_ADC_SetPrescaler(RST_CLK_ADC_C3_Prescaler_TypeDef ADC_CLK_DivValue)
{
    uint32_t Temp;

    /* Check the parameters. */
    assert_param(IS_RST_CLK_ADC_C3_DIV(ADC_CLK_DivValue));

    Temp = MDR_RST_CLK->ADC_CLOCK;

    /* Clear ADC_C3_SEL bits */
    Temp &= ~RST_CLK_ADC_CLOCK_ADC_C3_SEL_Msk;

    /* Set ADC_C3_SEL bits */
    Temp |= (uint32_t)ADC_CLK_DivValue;

    /* Store the new value */
    MDR_RST_CLK->ADC_CLOCK = Temp;
}

/**
 * @brief  Enable or disable the ADC_CLK clock.
 * @param  NewState: @ref FunctionalState - a new state of the ADC_CLK clock.
 * @return None.
 */
void RST_CLK_ADC_ClkCmd(FunctionalState NewState)
{
    /* Check the parameters. */
    assert_param(IS_FUNCTIONAL_STATE(NewState));

    /* Form new value. */
    if (NewState != DISABLE) {
        /* Enable the ADC CLK by setting the ADC_CLK_EN bit in the ADC_CLOCK register. */
        MDR_RST_CLK->ADC_CLOCK |= RST_CLK_ADC_CLOCK_ADC_CLK_EN;
    } else {
        /* Disable the ADC CLK by resetting the ADC_CLK_EN bit in the ADC_CLOCK register. */
        MDR_RST_CLK->ADC_CLOCK &= ~RST_CLK_ADC_CLOCK_ADC_CLK_EN;
    }
}

/**
 * @brief  Get the ADC_CLK clock work state.
 * @param  None.
 * @return @ref FunctionalState - the current work state of the ADC_CLK clock.
 */
FunctionalState RST_CLK_ADC_GetClkCmdState(void)
{
    FunctionalState State;

    if ((MDR_RST_CLK->ADC_CLOCK & RST_CLK_ADC_CLOCK_ADC_CLK_EN) == 0) {
        State = DISABLE;
    } else {
        State = ENABLE;
    }

    return State;
}

/**
 * @brief  Set the RST_CLK_ADCUI clock configuration to the default reset state.
 * @param  None.
 * @return None.
 */
void RST_CLK_ADCUI_ClkDeInit(void)
{
    MDR_RST_CLK->ADC_CLOCK &= ~(RST_CLK_ADC_CLOCK_ADCUI_C1_SEL_Msk |
                                RST_CLK_ADC_CLOCK_ADCUI_C3_SEL_Msk |
                                RST_CLK_ADC_CLOCK_ADCUI_CLK_EN);
}

/**
 * @brief  Select the ADCUI_C1 clock source.
 * @param  ADCUI_CLK_C1_Source: @ref RST_CLK_ADCUI_ClockSource_TypeDef - specify the ADCUI_C1 clock source.
 * @return None.
 */
void RST_CLK_ADCUI_ClkSelection(RST_CLK_ADCUI_ClockSource_TypeDef ADCUI_CLK_C1_Source)
{
    uint32_t Temp = 0;

    /* Check the parameters. */
    assert_param(IS_RST_CLK_ADCUI_CLOCK_SOURCE(ADCUI_CLK_C1_Source));

    /* Select ADC_CLK source. */
    Temp = MDR_RST_CLK->ADC_CLOCK;

    /* Clear ADCUI_C1 SEL bits. */
    Temp &= ~RST_CLK_ADC_CLOCK_ADCUI_C1_SEL_Msk;

