piborisovich/microcontrollers/Milandr/Libraries/SPL/MDR32VF0xI/src/MDR32VF0xI_rst_clk.c
    if (NewState != DISABLE) {
        MDR_RST_CLK->PER2_CLOCK |= RST_CLK_PCLK;
    } else {
        MDR_RST_CLK->PER2_CLOCK &= ~RST_CLK_PCLK;
    }
}

/**
 * @brief  Get the work state of the specified peripheral PLCK clock.
 * @param  RST_CLK_PCLK: @ref RST_CLK_PCLK_TypeDef - specify the peripheral PCLK clock.
 * @return @ref FunctionalState - the current work state of the specified peripheral PLCK clock.
 */
FunctionalState RST_CLK_GetPCLKCmdState(RST_CLK_PCLK_TypeDef RST_CLK_PCLK)
{
    FunctionalState State;

    /* Check the parameters. */
    assert_param(IS_RST_CLK_PCLK(RST_CLK_PCLK));

    if ((MDR_RST_CLK->PER2_CLOCK & (uint32_t)RST_CLK_PCLK) == 0) {
        State = DISABLE;
    } else {
        State = ENABLE;
    }

    return State;
}

/**
 * @brief  Check whether a specified RST flag is set or not.
 * @param  RST_CLK_Flag: @ref RST_CLK_Flags_TypeDef - specify a flag to check.
 * @return @ref FlagStatus - the state of clock ready flag (SET or RESET).
 */
FlagStatus RST_CLK_GetFlagStatus(RST_CLK_Flags_TypeDef RST_CLK_Flag)
{
    FlagStatus Status;

    /* Check the parameters. */
    assert_param(IS_RST_CLK_FLAG(RST_CLK_Flag));

    /* Get the flag status on a proper position. */
    if ((MDR_RST_CLK->CLOCK_STATUS & (uint32_t)RST_CLK_Flag) != RESET) {
        Status = SET;
    } else {
        Status = RESET;
    }

    /* Return the flag status. */
    return Status;
}

/**
 * @brief  Put the values of on-chip clock frequencies into RST_CLK_Clocks structure.
 * @param  RST_CLK_Clocks: The pointer to the @ref RST_CLK_Freq_TypeDef structure which will hold
 *         the clock frequencies values.
 * @param  Clocks: Specify on-chip clocks to calculate and put into RST_CLK_Clocks structure.
 *         This parameter can be any combination of @ref RST_CLK_Frequencies_TypeDef values.
 * @return None.
 */
void RST_CLK_GetClocksFreq(RST_CLK_Freq_TypeDef* RST_CLK_Clocks, uint32_t Clocks)
{
    uint32_t CPU_C1_Freq = 0, PLL_Freq, PER1_C1_Freq = 0, HSI_C1_Freq, HSE_C1_Freq;
    uint32_t PER1_C2_Freq = 0;
    uint32_t ADCUI_Freq   = 0;
    uint32_t ADC_Freq     = 0;
    uint32_t HCLK_Freq    = 0;
    uint32_t Temp;

    uint32_t RegPLL, RegCPU, RegPER1, RegRTC;
    uint32_t RegADC = 0;

    /* Check the parameters. */
    assert_param(RST_CLK_Clocks != 0);
    assert_param(IS_RST_CLK_CLOCK_FREQUENCY(Clocks));

    /* Read registers. */
    RegPLL  = MDR_RST_CLK->PLL_CONTROL;
    RegCPU  = MDR_RST_CLK->CPU_CLOCK;
    RegPER1 = MDR_RST_CLK->PER1_CLOCK;
    RegRTC  = MDR_RST_CLK->RTC_CLOCK;

    /* Determine common sources frequencies. */

    /* Determine the CPU_C1 frequency. */
    switch (RegCPU & RST_CLK_CPU_CLOCK_CPU_C1_SEL_Msk) {
        case RST_CLK_CPU_C1_CLK_SRC_HSI:
            CPU_C1_Freq = HSI_FREQUENCY_Hz;
            break;
        case RST_CLK_CPU_C1_CLK_SRC_HSI_DIV_2:
            CPU_C1_Freq = HSI_FREQUENCY_Hz / 2;
            break;
        case RST_CLK_CPU_C1_CLK_SRC_HSE:
            CPU_C1_Freq = HSE_FREQUENCY_Hz;
            break;
        case RST_CLK_CPU_C1_CLK_SRC_HSE_DIV_2:
            CPU_C1_Freq = HSE_FREQUENCY_Hz / 2;
            break;
    }

    /* Determine the CPU PLL frequency. */
    Temp = ((RegPLL & RST_CLK_PLL_CONTROL_PLL_CPU_MUL_Msk) >> RST_CLK_PLL_CONTROL_PLL_CPU_MUL_Pos) + 1;
    if ((RegPLL & RST_CLK_PLL_CONTROL_PLL_CPU_SEL) != 0) {
        PLL_Freq = CPU_C1_Freq * Temp;
    } else {
        PLL_Freq = HSE_FREQUENCY_Hz * Temp;
    }

    /* Determine the PER_C1 frequency. */
    switch (RegPER1 & RST_CLK_PER1_CLOCK_PER1_C1_SEL_Msk) {
        case RST_CLK_PER1_C1_CLK_SRC_LSI:
            PER1_C1_Freq = LSI_FREQUENCY_Hz;
            break;
        case RST_CLK_PER1_C1_CLK_SRC_LSI_DIV_2:
            PER1_C1_Freq = LSI_FREQUENCY_Hz / 2;
            break;
        case RST_CLK_PER1_C1_CLK_SRC_LSE:
            PER1_C1_Freq = LSE_FREQUENCY_Hz;
            break;
        case RST_CLK_PER1_C1_CLK_SRC_LSE_DIV_2:
            PER1_C1_Freq = LSE_FREQUENCY_Hz / 2;
            break;
    }

    /* Compute the RTCHSE_CLK frequency. */
    if ((RegRTC & ((uint32_t)0x8)) == 0) {
        HSE_C1_Freq = HSE_FREQUENCY_Hz;
    } else {
        HSE_C1_Freq = HSE_FREQUENCY_Hz >> ((RegRTC & ((uint32_t)0x7)) + 1);
    }
    if ((Clocks & RST_CLK_CLOCK_FREQ_RTCHSE) != 0) {
        RST_CLK_Clocks->RTCHSE_Frequency = HSE_C1_Freq;
    }

    /* Compute the RTCHSI_CLK frequency. */
    Temp = RegRTC >> RST_CLK_RTC_CLOCK_HSI_SEL_Pos;
    if ((Temp & ((uint32_t)0x8)) == 0) {
        HSI_C1_Freq = HSI_FREQUENCY_Hz;
    } else {
        HSI_C1_Freq = HSI_FREQUENCY_Hz >> ((Temp & ((uint32_t)0x7)) + 1);
    }
    if ((Clocks & RST_CLK_CLOCK_FREQ_RTCHSI) != 0) {
        RST_CLK_Clocks->RTCHSI_Frequency = HSI_C1_Freq;
    }

    /* Compute necessary frequencies. */

#if defined(USE_MDR32F02_REV_1X)
    if ((Clocks & RST_CLK_CLOCK_FREQ_CPU_CLK) != 0) {
#else
    if ((Clocks & (RST_CLK_CLOCK_FREQ_CPU_CLK | RST_CLK_CLOCK_FREQ_MACHINE_TIMER)) != 0) {
#endif
        switch (RegCPU & RST_CLK_CPU_CLOCK_HCLK_SEL_Msk) {
            case RST_CLK_CPU_CLOCK_HCLK_SEL_HSI:
                HCLK_Freq = HSI_FREQUENCY_Hz;
                break;
            case RST_CLK_CPU_CLOCK_HCLK_SEL_CPU_C3:
                /* Determine the CPU_C2 frequency. */
                if ((RegCPU & RST_CLK_CPU_CLOCK_CPU_C2_SEL) != 0) {
                    HCLK_Freq = PLL_Freq;
                } else {
                    HCLK_Freq = CPU_C1_Freq;
                }

                /* Determine the CPU_C3 frequency. */
                Temp = ((RegCPU & RST_CLK_CPU_CLOCK_CPU_C3_SEL_Msk) >> RST_CLK_CPU_CLOCK_CPU_C3_SEL_Pos);
                if ((Temp & ((uint32_t)0x8)) != 0x00) {
                    HCLK_Freq = HCLK_Freq >> ((Temp & ((uint32_t)0x7)) + 1);
                }
                break;
            case RST_CLK_CPU_CLOCK_HCLK_SEL_LSE:
                HCLK_Freq = LSE_FREQUENCY_Hz;
                break;
            case RST_CLK_CPU_CLOCK_HCLK_SEL_LSI:
                HCLK_Freq = LSI_FREQUENCY_Hz;
                break;
        }
        if ((Clocks & RST_CLK_CLOCK_FREQ_CPU_CLK) != 0) {
            RST_CLK_Clocks->CPU_CLK_Frequency = HCLK_Freq;
        }
    }

    if ((Clocks & RST_CLK_CLOCK_FREQ_MACHINE_TIMER) != 0) {
#if defined(USE_MDR32F02_REV_1X)
        RST_CLK_Clocks->MachineTimer_Frequency = LSE_FREQUENCY_Hz;
#else
        Temp                                   = (MDR_RST_CLK->DIV_SYS_TIM & RST_CLK_DIV_SYS_TIM_DIV_SYS_TIM_Msk) + 2;
        RST_CLK_Clocks->MachineTimer_Frequency = HCLK_Freq / Temp;
#endif
    }

