piborisovich/microcontrollers/Milandr/Libraries/SPL/MDR32VF0xI/src/MDR32VF0xI_rst_clk.c
    if ((Clocks & (RST_CLK_CLOCK_FREQ_UART1 | RST_CLK_CLOCK_FREQ_UART2 | RST_CLK_CLOCK_FREQ_UART3 | RST_CLK_CLOCK_FREQ_UART4 |
                   RST_CLK_CLOCK_FREQ_TIMER1 | RST_CLK_CLOCK_FREQ_TIMER2 | RST_CLK_CLOCK_FREQ_TIMER3 | RST_CLK_CLOCK_FREQ_TIMER4 |
                   RST_CLK_CLOCK_FREQ_SSP1 | RST_CLK_CLOCK_FREQ_SSP2 | RST_CLK_CLOCK_FREQ_SSP3)) != 0) {
        /* Determine clock frequency PER1_C2. */
        switch (RegPER1 & RST_CLK_PER1_CLOCK_PER1_C2_SEL_Msk) {
            case RST_CLK_PER1_C2_CLK_SRC_CPU_C1:
                PER1_C2_Freq = CPU_C1_Freq;
                break;
            case RST_CLK_PER1_C2_CLK_SRC_PER1_C1:
                PER1_C2_Freq = PER1_C1_Freq;
                break;
            case RST_CLK_PER1_C2_CLK_SRC_PLLCPU:
                PER1_C2_Freq = PLL_Freq;
                break;
            case RST_CLK_PER1_C2_CLK_SRC_HSI_C1_CLK:
                PER1_C2_Freq = HSI_C1_Freq;
                break;
        }
        if ((Clocks & (RST_CLK_CLOCK_FREQ_UART1 | RST_CLK_CLOCK_FREQ_UART2 | RST_CLK_CLOCK_FREQ_UART3 | RST_CLK_CLOCK_FREQ_UART4)) != 0) {
            Temp = MDR_RST_CLK->UART_CLOCK;
            if ((Clocks & RST_CLK_CLOCK_FREQ_UART1) != 0) {
                RST_CLK_Clocks->UART_Frequency[0] = PER1_C2_Freq >> ((Temp & RST_CLK_UART_CLOCK_UART1_BRG_Msk) >> RST_CLK_UART_CLOCK_UART1_BRG_Pos);
            }
            if ((Clocks & RST_CLK_CLOCK_FREQ_UART2) != 0) {
                RST_CLK_Clocks->UART_Frequency[1] = PER1_C2_Freq >> ((Temp & RST_CLK_UART_CLOCK_UART2_BRG_Msk) >> RST_CLK_UART_CLOCK_UART2_BRG_Pos);
            }
            if ((Clocks & RST_CLK_CLOCK_FREQ_UART3) != 0) {
                RST_CLK_Clocks->UART_Frequency[2] = PER1_C2_Freq >> ((Temp & RST_CLK_UART_CLOCK_UART3_BRG_Msk) >> RST_CLK_UART_CLOCK_UART3_BRG_Pos);
            }
            if ((Clocks & RST_CLK_CLOCK_FREQ_UART4) != 0) {
                RST_CLK_Clocks->UART_Frequency[3] = PER1_C2_Freq >> ((Temp & RST_CLK_UART_CLOCK_UART4_BRG_Msk) >> RST_CLK_UART_CLOCK_UART4_BRG_Pos);
            }
        }
        if ((Clocks & (RST_CLK_CLOCK_FREQ_TIMER1 | RST_CLK_CLOCK_FREQ_TIMER2 | RST_CLK_CLOCK_FREQ_TIMER3 | RST_CLK_CLOCK_FREQ_TIMER4)) != 0) {
            Temp = MDR_RST_CLK->TIM_CLOCK;
            if ((Clocks & RST_CLK_CLOCK_FREQ_TIMER1) != 0) {
                RST_CLK_Clocks->TIMER_Frequency[0] = PER1_C2_Freq >> ((Temp & RST_CLK_TIM_CLOCK_TIM1_BRG_Msk) >> RST_CLK_TIM_CLOCK_TIM1_BRG_Pos);
            }
            if ((Clocks & RST_CLK_CLOCK_FREQ_TIMER2) != 0) {
                RST_CLK_Clocks->TIMER_Frequency[1] = PER1_C2_Freq >> ((Temp & RST_CLK_TIM_CLOCK_TIM2_BRG_Msk) >> RST_CLK_TIM_CLOCK_TIM2_BRG_Pos);
            }
            if ((Clocks & RST_CLK_CLOCK_FREQ_TIMER3) != 0) {
                RST_CLK_Clocks->TIMER_Frequency[2] = PER1_C2_Freq >> ((Temp & RST_CLK_TIM_CLOCK_TIM3_BRG_Msk) >> RST_CLK_TIM_CLOCK_TIM3_BRG_Pos);
            }
            if ((Clocks & RST_CLK_CLOCK_FREQ_TIMER4) != 0) {
                RST_CLK_Clocks->TIMER_Frequency[3] = PER1_C2_Freq >> ((Temp & RST_CLK_TIM_CLOCK_TIM4_BRG_Msk) >> RST_CLK_TIM_CLOCK_TIM4_BRG_Pos);
            }
        }
        if ((Clocks & (RST_CLK_CLOCK_FREQ_SSP1 | RST_CLK_CLOCK_FREQ_SSP2 | RST_CLK_CLOCK_FREQ_SSP3)) != 0) {
            Temp = MDR_RST_CLK->SSP_CLOCK;
            if ((Clocks & RST_CLK_CLOCK_FREQ_SSP1) != 0) {
                RST_CLK_Clocks->SSP_Frequency[0] = PER1_C2_Freq >> ((Temp & RST_CLK_SSP_CLOCK_SSP1_BRG_Msk) >> RST_CLK_SSP_CLOCK_SSP1_BRG_Pos);
            }
            if ((Clocks & RST_CLK_CLOCK_FREQ_SSP2) != 0) {
                RST_CLK_Clocks->SSP_Frequency[1] = PER1_C2_Freq >> ((Temp & RST_CLK_SSP_CLOCK_SSP2_BRG_Msk) >> RST_CLK_SSP_CLOCK_SSP2_BRG_Pos);
            }
            if ((Clocks & RST_CLK_CLOCK_FREQ_SSP3) != 0) {
                RST_CLK_Clocks->SSP_Frequency[2] = PER1_C2_Freq >> ((Temp & RST_CLK_SSP_CLOCK_SSP3_BRG_Msk) >> RST_CLK_SSP_CLOCK_SSP3_BRG_Pos);
            }
        }
    }

    if ((Clocks & RST_CLK_CLOCK_FREQ_WWDG) != 0) {
        switch (RegPER1 & RST_CLK_PER1_CLOCK_WDG_C2_SEL_Msk) {
            case RST_CLK_WWDG_C2_CLK_SRC_CPU_C1:
                Temp = CPU_C1_Freq;
                break;
            case RST_CLK_WWDG_C2_CLK_SRC_WWDG_C1:
                switch (RegPER1 & RST_CLK_PER1_CLOCK_WDG_C1_SEL_Msk) {
                    case RST_CLK_WWDG_C1_CLK_SRC_LSI:
                        Temp = LSI_FREQUENCY_Hz;
                        break;
                    case RST_CLK_WWDG_C1_CLK_SRC_LSI_DIV_2:
                        Temp = LSI_FREQUENCY_Hz / 2;
                        break;
                    case RST_CLK_WWDG_C1_CLK_SRC_LSE:
                        Temp = LSE_FREQUENCY_Hz;
                        break;
                    case RST_CLK_WWDG_C1_CLK_SRC_LSE_DIV_2:
                        Temp = LSE_FREQUENCY_Hz / 2;
                        break;
                }
                break;
            case RST_CLK_WWDG_C2_CLK_SRC_PLLCPU:
                Temp = PLL_Freq;
                break;
            case RST_CLK_WWDG_C2_CLK_SRC_HSI_C1_CLK:
                Temp = HSI_C1_Freq;
                break;
        }
        RST_CLK_Clocks->WWDG_Frequency = Temp >> ((RegPER1 & RST_CLK_PER1_CLOCK_WDG_BRG_Msk) >> RST_CLK_PER1_CLOCK_WDG_BRG_Pos);
    }

    if ((Clocks & (RST_CLK_CLOCK_FREQ_ADC | RST_CLK_CLOCK_FREQ_ADCUI)) != 0) {
        RegADC = MDR_RST_CLK->ADC_CLOCK;
        if ((Clocks & RST_CLK_CLOCK_FREQ_ADC) != 0) {
            switch (RegADC & RST_CLK_ADC_CLOCK_ADC_C1_SEL_Msk) {
                case RST_CLK_ADC_CLK_SRC_CPU_C1:
                    ADC_Freq = CPU_C1_Freq;
                    break;
                case RST_CLK_ADC_CLK_SRC_PER1_C1:
                    ADC_Freq = PER1_C1_Freq;
                    break;
                case RST_CLK_ADC_CLK_SRC_PLLCPU:
                    ADC_Freq = PLL_Freq;
                    break;
                case RST_CLK_ADC_CLK_SRC_HSE_C1_CLK:
                    ADC_Freq = HSE_C1_Freq;
                    break;
            }
            Temp = RegADC >> RST_CLK_ADC_CLOCK_ADC_C3_SEL_Pos;
            if ((Temp & ((uint32_t)0x8)) != 0) {
                ADC_Freq = ADC_Freq >> ((Temp & (uint32_t)0x7) + 1);
            }

            RST_CLK_Clocks->ADC_Frequency = ADC_Freq;
        }
    }

    if ((Clocks & RST_CLK_CLOCK_FREQ_ADCUI) != 0) {
        switch (RegADC & RST_CLK_ADC_CLOCK_ADCUI_C1_SEL_Msk) {
            case RST_CLK_ADCUI_CLK_SRC_CPU_C1:
                ADCUI_Freq = CPU_C1_Freq;
                break;
            case RST_CLK_ADCUI_CLK_SRC_PER1_C1:
                ADCUI_Freq = PER1_C1_Freq;
                break;
            case RST_CLK_ADCUI_CLK_SRC_PLLCPU:
                ADCUI_Freq = PLL_Freq;
                break;
            case RST_CLK_ADCUI_CLK_SRC_HSE_C1_CLK:
                ADCUI_Freq = HSE_C1_Freq;
                break;
        }
        Temp = RegADC >> RST_CLK_ADC_CLOCK_ADCUI_C3_SEL_Pos;
        if ((Temp & ((uint32_t)0x8)) != 0) {
            ADCUI_Freq = ADCUI_Freq >> ((Temp & ((uint32_t)0x7)) + 1);
        }

        RST_CLK_Clocks->ADCUI_Frequency = ADCUI_Freq;
    }
}

/** @} */ /* End of the group RST_CLK_Exported_Functions */

/** @} */ /* End of the group RST_CLK */

/** @} */ /* End of the group MDR32VF0xI_StdPeriph_Driver */

/*********************** (C) COPYRIGHT 2025 Milandr ****************************
 *
 * END OF FILE MDR32VF0xI_rst_clk.c */

